{
  "basics": {
    "name": "Diego Navarro",
    "label": "Software Engineer",
    "image": "",
    "email": "hello@giegognt.dev",
    "phone": "",
    "url": "https://diegognt.dev",
    "summary": "Dedicated Software Engineer with +9 years of experience in developing intuitive and high-performing web user experiences. Proficient in programming languages like JavaScript, TypeScript, and Python. Skilled in modern UI libraries, particularly React and its associated ecosystem, with a strong emphasis on delivering clean and maintainable code. Proven track record in technical leadership, effective communication, and collaborating across disciplines to ensure exceptional user experiences and project success.",
    "location": {
      "address": "Calle 86A #69T-41",
      "postalCode": "110221",
      "city": "Bogotá",
      "countryCode": "CO",
      "region": "Capital District"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "diegognt",
        "url": "https://github.com/diegognt"
      },
      {
        "network": "LinkedIn",
        "username": "diegognt",
        "url": "https://www.linkedin.com/in/diego-navarro-tesillo-79387b19/"
      }
    ]
  },
  "work": [
    {
      "name": "Huge Inc.",
      "position": "Senior UI Engineer",
      "url": "https://hugeinc.com",
      "startDate": "April, 2021",
      "endDate": "Today",
      "summary": "",
      "highlights": [
        "Streamlined forms creation by integrating a headless CMS and leveraging existing React components. Implemented dynamic rendering of forms based on CMS definitions. Resulted in a 25% reduction in development time compared to initial estimates, optimizing workflows and enhancing efficiency",
        "Mentored junior engineers, providing them with guidance on their career development. Held regular 1:1 sessions to offer guidance, constructive feedback, and set goals for growth",
        "Led a team of 3 software engineers and one QA to handle the development of the Google Privacy Sandbox initiative website."
      ]
    },
    {
      "name": "Huge Inc.",
      "position": "Frontend Engineer",
      "url": "https://hugeinc.com",
      "startDate": "July, 2017",
      "endDate": "March, 2021",
      "summary": "",
      "highlights": [
        "Built a tool using the Lighthouse NodeJS API and Google Sheets API to monitor the Lighthouses score of the android.com site, boosting the site scores and reducing the bounce rate by 3% over a week",
        "Built a tool using NodeJS and Puppetier.js for text mining and web crawler for collecting non-English content from the Google Workspace legacy site and put it in a documental DB, reducing the initial estimation of effort by",
        "Built a visual regression test suite using Puppeteer.js and BackstopJS, for the Google Workspace legacy site that helped to reduced the amount of bugs reported on production by 10% over a month."
      ]
    }
  ],
  "education": [
    {
      "institution": "Universidad Tecnologica de Bolivar, Cartagena, Colombia",
      "area": "Systems Engineering",
      "studyType": "Bachelor",
      "endDate": "April, 2017"
    }
  ],
  "certificates": [
    {
      "name": "Certificate",
      "date": "2021-11-07",
      "issuer": "Company",
      "url": "https://certificate.com"
    }
  ],
  "skills": [
    {
      "name": "Technical leadership"
    },
    {
      "name": "Effective self-management"
    },
    {
      "name": "Effective communication"
    },
    {
      "name": "Collaboration with other disciplines"
    }
  ]
}
